#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```terraform
aws_ssm_parameter.app_context: Refreshing state... [id=/hagrid/app-context]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # aws_ssm_parameter.okta_credentials will be created
  + resource "aws_ssm_parameter" "okta_credentials" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Okta API credentials for app group context updater"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/hagrid/okta-credentials"
      + tags           = {
          + "Name"    = "hagrid-okta-credentials"
          + "Project" = "hagrid"
        }
      + tags_all       = {
          + "ManagedBy" = "terraform"
          + "Name"      = "hagrid-okta-credentials"
          + "Project"   = "hagrid"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.okta_app_group_lambda.data.archive_file.placeholder will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "placeholder" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/okta_app_group_lambda/placeholder.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + type                = "zip"

      + source {
          + content  = <<-EOT
                def lambda_handler(event, context):
                    return {'statusCode': 200, 'body': 'Placeholder - update code manually'}
            EOT
          + filename = "index.py"
        }
    }

  # module.okta_app_group_lambda.aws_iam_role.lambda_role will be created
  + resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "hagrid-okta-app-group-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "hagrid-okta-app-group-lambda-role"
        }
      + tags_all              = {
          + "ManagedBy" = "terraform"
          + "Name"      = "hagrid-okta-app-group-lambda-role"
          + "Project"   = "hagrid"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.okta_app_group_lambda.aws_iam_role_policy.lambda_okta_credentials will be created
  + resource "aws_iam_role_policy" "lambda_okta_credentials" {
      + id          = (known after apply)
      + name        = "hagrid-okta-lambda-credentials"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.okta_app_group_lambda.local_file.placeholder_code will be created
  + resource "local_file" "placeholder_code" {
      + content              = <<-EOT
            def lambda_handler(event, context):
                return {'statusCode': 200, 'body': 'Placeholder - update code manually'}
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "modules/okta_app_group_lambda/placeholder/index.py"
      + id                   = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + lambda_role_arn                 = (known after apply)
  + okta_credentials_parameter_arn  = (known after apply)
  + okta_credentials_parameter_name = "/hagrid/okta-credentials"

```

</details>

*Pushed by: @m0liere, Action: `pull_request`*